import { Component, OnInit } from '@angular/core';

@Component({
  selector: 'app-aboutus-targets-responsive',
  templateUrl: './aboutus-targets-responsive.component.html',
  styleUrls: ['./aboutus-targets-responsive.component.scss'],
})
export class AboutusTargetsResponsiveComponent implements OnInit {
  defualtObj: IItemsInfo[] = [
    {
      head: 'استفاده از هوش مصنوعی در معاملات فارکس',
      text: 'هوش مصنوعی در عین حال که فرصت است، می تواند تهدید هم باشد. لذا باید در طی مسیر، به معیارها و پارامترهای زیادی توجه شود تا ضرر به حداقل برسد و سوددهی و امنیت سرمایه افزایش یابد. ما با بهره‌گیری از الگوریتم‌ها و هوش مصنوعی، ربات‌های معاملاتی ایجاد می‌کنیم که به شما کمک می‌کنند تا تصمیمات درست و بهینه‌تری در بازار فارکس بگیرید و با کمترین دانش، موفقیت در فارکس را تجربه کنید. ',
    },
    {
      head: 'سهولت در معاملات و کسب سود ثابت از فارکس',
      text: 'هدف ما این است که فرآیند معاملات تجاری را برای شما ساده‌تر و کارآمدتر کنیم. اولویت امنیت سرمایه و سپس سوددهی است. پس با خرید ربات سفارشی قطعا سودده ما، برای بهبود کارکرد و سهولت در معاملات خود بهره ببرید. این یعنی ارز آوری.',
    },
    {
      head: 'MQL تبدیل شدن به نسخه‌ای از',
      text: 'هدف ما تبدیل شدن به نسخه‌ای از MQL برای ایرانیان است که بتوانیم مرجع قابل اعتمادی برای تریدرها در ایران‌ باشیم که بتوانند هر آنچه مربوط به بازارهای مالی می باشد اعم از آموزش، ربات های معامله گر، اندیکاتورها، سیستم کپی ترید و غیره را در ایرانی اکسپرت دسترسی داشته باشند',
    },
    {
      head: 'آموزش و پشتیبانی مداوم',
      text: 'ما با ارائه پشتیبانی فنی مداوم، سعی داریم تا شما را در مسیر موفقیت در دنیای معاملات فارکس و بازارهای مالی همراهی کنیم.',
    },
  ];

  selected: number;
  ngOnInit(): void {
    this.choosenItem(0);
  }

  choosenItem(n: number): void {
    this.selected = n;
  }
}

interface IItemsInfo {
  head: string;
  text: string;
}
