import { Component } from '@angular/core';

@Component({
  selector: 'app-articles-money',
  templateUrl: './articles-money.component.html',
  styleUrls: ['./articles-money.component.scss']
})
export class ArticlesMoneyComponent {
  boxCol1 : Array<any> =[
    {
      title:'معامله بیش از حد',
      desc: 'معامله بیش از حد زمانی اتفاق می‌افتد که معامله‌گران سرمایه خود را در یک معامله به خطر می‌اندازند و سعی در جبران آن و انتقام از بازار دارند یا زمانی که تریدر به دلیل نداشتن فرمول مدیریت سرمایه در ترید، احساساتی عمل کرده و طمع او باعث می‌شود تا معاملات زیادی را باز کند که در اغلب موارد این معاملات با ضرر روبرو می‌شوند. باز کردن معامله بیش از حد نه‌تنها استرس شما را هنگام معامله بیشتر می‌کند، بلکه باعث ضرر‌های متوالی و سنگین در بازار می‌شود'
    },
    {
      title:'انتقام از بازار',
      desc: 'برخی از معامله‌گران پس از تجربه ضرر و زیان وارد فاز انتقام از بازار می‌شوند. زمانی که یک تریدر سعی در انتقام از بازار دارد، کنترل احساسات خود را از دست داده و تصمیماتی می‌گیرد که ریسک بالایی دارند و اغلب منجر به زیان‌های بزرگ می‌شود'
    },
    {
      title:'R/R نادیده گرفتن نسبت',
      desc: ' به این معنی است که R/R نادیده گرفتن نسبت معامله‌گران ممکن است وارد معاملاتی شوند که به نسبت سودی که دریافت می‌کنند ریسک بالایی داشته باشند. همین امر موجب منفی شدن برایند فرد در طولانی مدت خواهد شد. پیشنهاد میکنیم اگر تجربه زیادی در بازارهای مالی ندارید آنها R/R به هیچ عنوان وارد معاملاتی که نسبتکمتر از ۲ است نشوید'
    },
    {
      title:'نادیده گرفتن شرایط بازار',
      desc: 'عدم تطبیق با شرایط متغیر بازار می‌تواند منجر به زیانهای سنگنین شود. معامله‌گران باید استراتژی‌ها و مدیریت ریسک خود را بر اساس شرایط فعلی بازار تنظیم کنند'
    },
  ]
  boxCol2 : Array<any> =[
    {
      title:'فقدان برنامه معاملاتی',
      desc: 'نداشتن یک برنامه معاملاتی کاملاً تعریف شده که شامل استراتژي‌های مدیریت سرمایه در ترید باشد، یک اشتباه رایج است. معامله‌گران بدون برنامه به احتمال زیاد بر اساس احساسات وارد معامله می‌شوند'
    },
    {
      title:'استفاده از اهرم بالا',
      desc: 'استفاده از اهرم بالا می‌تواند سود را چندین برابر کند، اما در عین حال می‌تواند تمام سرمایه شما را از بین ببرد. معامله‌گرانی که در استراتژی سرمایه خود، ریسک معاملات را محاسبه نمی‌کنند، اغلب در این دام می‌افتند و تمام سرمایه خود را به مرور از دست می‌دهند'
    },
    {
      title:'عدم محاسبه حجم ورود به معامله',
      desc: 'معامله‌گرانی که حجم مناسبی را برای ورود به معامله انتخاب نمی‌کنند در اغلب اوقات در چند معامله پی‌درپی تمام سرمایه خود را از دست می‌دهند. محاسبه حجم برای ورود به معامله به شما کمک می‌کند که نه‌تنها ضرر و زیان خود را به حداقل برسانید بلکه حداکثر سود ممکن را از معامله دریافت کنید. همچنین محاسبه حجم مناسب برای ورود به معامله به شما کمک می‌کند که روی احساسات خود کنترل بیشتری داشته باشید و از گرفتن تصمیمات احساسی دوری کنید'
    },
    {
      title:'عدم صبر',
      desc: 'بی حوصلگی می‌تواند منجر به خروج یا ورود زودهنگام شود و باعث شود معامله‌گران سودهای احتمالی را از دست بدهند یا متحمل زیان‌های غیر ضروری شوند.برای جلوگیری از این اشتباهات رایج مدیریت سرمایه، معامله‌گران باید یک برنامه معاملاتی ساختاریافته ایجاد کنند، به آن پایبند باشند، حتما در هر شرایطی از حد ضرر استفاده کنند، سبد سرمایه داشته باشند و به طور مداوم در مورد بازارها و استراتژی‌های معاملاتی آموزش ببینند. علاوه بر این، کنترل احساسات و بررسی معاملات قبلی و درک دلیل شکست معامله از اهمیت بالایی برخوردار است'
    },
  ]
  boxCol3 : Array<any> =[
    {
      title:'نادیده گرفتن حد ضرر',
      desc: 'عدم استفاده از حد ضرر یا نادیده گرفتن آن یک اشتباه خطرناک است که اغلب تریدر‌های مبتدی و تازه‌کار این اشتباه را مرتکب می‌شوند. حد ضرر برای محدود کردن ضررهای سنگین احتمالی و حفظ سرمایه ضروری است'
    },
    {
      title:'پخش نکردن سرمایه و نداشتن سبد سرمایه',
      desc: 'اگر سرمایه به صورت کامل در یک معامله یا دارایی خاص سرمایه‌گذاری شود، معامله‌گر به طور نامعقولی بیشتر در معرض ریسک می‌افتد. در صورتی که این معامله به خوبی پیش نرود، می‌تواند منجر به خسارتهای قابل توجهی شود. در صورتی که معامله‌گر تمام سرمایه خود را در یک معامله قرار دهد، هر تغییر کوچک در قیمت می‌تواند تأثیر قابل توجهی بر سرمایه وی داشته باشد'
    },
    {
      title:'اطمینان بیش از حد به تحلیل',
      desc: 'اعتماد بیش از حد می‌تواند معامله‌گران را به سمت باز کردن معامله با حجم‌های بزرگتر یا نادیده گرفتن قوانین مدیریت ریسک سوق دهد. تواضع و واقع بین بودن در مورد توانایی‌های معاملاتی خود بسیار ضروری است'
    },
  ]
}
