import { Component } from '@angular/core';

@Component({
  selector: 'app-articles-money',
  templateUrl: './articles-money.component.html',
  styleUrls: ['./articles-money.component.scss']
})
export class ArticlesMoneyComponent {
  color = '#ECECEC';

  listElems: Array<any> =
  [
   {
     title : 'مدیریت سرمایه چیست و چرا در بازارهای مالی مهم است؟',
     id : 1,
     sub :
     [{
       title : 'چرا مدیریت سرمایه  برای معامله‌گران مهم است؟',
       id : 2
     },
     { title: 'مدیریت سرمایه مناسب چه افرادی است؟',
     id : 3
     }],
     active : false,
   },
   {
     title : 'اهمیت و اهداف مدیریت سرمایه برای ترید در بازار فارکس',
     id : 4,
     sub :
     [{
       title : 'چرا باید از مدیریت سرمایه در ترید بازار فارکس استفاده کرد',
       id : 5
     }],
     active : false,
   },
   {
     title : 'اشتباهات رایج معامله‌گران هنگام مدیریت سرمایه چیست وچگونه می‌توان پیشگیری کرد؟',
     id : 6,
     active : false,
   },
   {
     title : 'تقسیم سرمایه در بازار فارکس به چه صورت است؟',
     id : 7,
     active : false,
   },
   {
     title : 'مهم ترین فاکتور مدیریت سرمایه در بازار فارکس چیست؟',
     id : 8,
     active : false,
   },
   {
     title : 'حداقل سرمایه در بازار فارکس به چه صورت است؟',
     id : 9,
     sub :
     [
     {
       title : 'استراتژی معاملاتی',
       id : 9
     },
     {
       title : 'تجربه ',
       id : 9
     },
     {
       title : 'بروکر',
       id : 9
     }],
     active : false,
   },
   {
     title : 'بهترین روش مدیریت سرمایه در ترید',
     id : 13,
     active : false,
   },
   {
     title : 'انواع استراتژی مدیریت سرمایه چیست؟',
     id : 14,
     active : false,
   },
   {
     title : 'عوامل مهم در سیستم مدیریت سرمایه چیست؟',
     id : 15,
     active : false,
   },
   {
     title : 'عدم استفاده از مدیریت ریسک چه عواقبی دارد؟',
     id : 16,
     active : false,
   },
   {
     title : 'عملکرد موثر تریدرها برای بهبود مدیریت سرمایه و بازدهی بیشتر استفاده میکنند؟',
     id : 17,
     active : false,
   },
   {
     title : 'تحلیل مالی(سود و زیان) برای مدیریت سرمایه به چه صورت است؟',
     id : 18,
     active : false,
   },
   {
     title : 'اجرای استراتژی مدیریت سرمایه برای محدود کردن ضررهای احتمالی',
     id : 19,
     active : false,
   },
  ];


  scroll(event: boolean) {
  }


// ===============[باکس ها]=======







  boxCol1 : Array<any> =[
    {
      title:'معامله بیش از حد',
      desc: 'معامله بیش از حد زمانی اتفاق می‌افتد که معامله‌گران سرمایه خود را در یک معامله به خطر می‌اندازند و سعی در جبران آن و انتقام از بازار دارند یا زمانی که تریدر به دلیل نداشتن فرمول مدیریت سرمایه در ترید، احساساتی عمل کرده و طمع او باعث می‌شود تا معاملات زیادی را باز کند که در اغلب موارد این معاملات با ضرر روبرو می‌شوند. باز کردن معامله بیش از حد نه‌تنها استرس شما را هنگام معامله بیشتر می‌کند، بلکه باعث ضرر‌های متوالی و سنگین در بازار می‌شود'
    },
    {
      title:'انتقام از بازار',
      desc: 'برخی از معامله‌گران پس از تجربه ضرر و زیان وارد فاز انتقام از بازار می‌شوند. زمانی که یک تریدر سعی در انتقام از بازار دارد، کنترل احساسات خود را از دست داده و تصمیماتی می‌گیرد که ریسک بالایی دارند و اغلب منجر به زیان‌های بزرگ می‌شود'
    },
    {
      title:'R/R نادیده گرفتن نسبت',
      desc: ' به این معنی است که R/R نادیده گرفتن نسبت معامله‌گران ممکن است وارد معاملاتی شوند که به نسبت سودی که دریافت می‌کنند ریسک بالایی داشته باشند. همین امر موجب منفی شدن برایند فرد در طولانی مدت خواهد شد. پیشنهاد میکنیم اگر تجربه زیادی در بازارهای مالی ندارید آنها R/R به هیچ عنوان وارد معاملاتی که نسبتکمتر از ۲ است نشوید'
    },
    {
      title:'نادیده گرفتن شرایط بازار',
      desc: 'عدم تطبیق با شرایط متغیر بازار می‌تواند منجر به زیانهای سنگنین شود. معامله‌گران باید استراتژی‌ها و مدیریت ریسک خود را بر اساس شرایط فعلی بازار تنظیم کنند'
    },
  ]
  boxCol2 : Array<any> =[
    {
      title:'فقدان برنامه معاملاتی',
      desc: 'نداشتن یک برنامه معاملاتی کاملاً تعریف شده که شامل استراتژي‌های مدیریت سرمایه در ترید باشد، یک اشتباه رایج است. معامله‌گران بدون برنامه به احتمال زیاد بر اساس احساسات وارد معامله می‌شوند'
    },
    {
      title:'استفاده از اهرم بالا',
      desc: 'استفاده از اهرم بالا می‌تواند سود را چندین برابر کند، اما در عین حال می‌تواند تمام سرمایه شما را از بین ببرد. معامله‌گرانی که در استراتژی سرمایه خود، ریسک معاملات را محاسبه نمی‌کنند، اغلب در این دام می‌افتند و تمام سرمایه خود را به مرور از دست می‌دهند'
    },
    {
      title:'عدم محاسبه حجم ورود به معامله',
      desc: 'معامله‌گرانی که حجم مناسبی را برای ورود به معامله انتخاب نمی‌کنند در اغلب اوقات در چند معامله پی‌درپی تمام سرمایه خود را از دست می‌دهند. محاسبه حجم برای ورود به معامله به شما کمک می‌کند که نه‌تنها ضرر و زیان خود را به حداقل برسانید بلکه حداکثر سود ممکن را از معامله دریافت کنید. همچنین محاسبه حجم مناسب برای ورود به معامله به شما کمک می‌کند که روی احساسات خود کنترل بیشتری داشته باشید و از گرفتن تصمیمات احساسی دوری کنید'
    },
    {
      title:'عدم صبر',
      desc: 'بی حوصلگی می‌تواند منجر به خروج یا ورود زودهنگام شود و باعث شود معامله‌گران سودهای احتمالی را از دست بدهند یا متحمل زیان‌های غیر ضروری شوند.برای جلوگیری از این اشتباهات رایج مدیریت سرمایه، معامله‌گران باید یک برنامه معاملاتی ساختاریافته ایجاد کنند، به آن پایبند باشند، حتما در هر شرایطی از حد ضرر استفاده کنند، سبد سرمایه داشته باشند و به طور مداوم در مورد بازارها و استراتژی‌های معاملاتی آموزش ببینند. علاوه بر این، کنترل احساسات و بررسی معاملات قبلی و درک دلیل شکست معامله از اهمیت بالایی برخوردار است'
    },
  ]
  boxCol3 : Array<any> =[
    {
      title:'نادیده گرفتن حد ضرر',
      desc: 'عدم استفاده از حد ضرر یا نادیده گرفتن آن یک اشتباه خطرناک است که اغلب تریدر‌های مبتدی و تازه‌کار این اشتباه را مرتکب می‌شوند. حد ضرر برای محدود کردن ضررهای سنگین احتمالی و حفظ سرمایه ضروری است'
    },
    {
      title:'پخش نکردن سرمایه و نداشتن سبد سرمایه',
      desc: 'اگر سرمایه به صورت کامل در یک معامله یا دارایی خاص سرمایه‌گذاری شود، معامله‌گر به طور نامعقولی بیشتر در معرض ریسک می‌افتد. در صورتی که این معامله به خوبی پیش نرود، می‌تواند منجر به خسارتهای قابل توجهی شود. در صورتی که معامله‌گر تمام سرمایه خود را در یک معامله قرار دهد، هر تغییر کوچک در قیمت می‌تواند تأثیر قابل توجهی بر سرمایه وی داشته باشد'
    },
    {
      title:'اطمینان بیش از حد به تحلیل',
      desc: 'اعتماد بیش از حد می‌تواند معامله‌گران را به سمت باز کردن معامله با حجم‌های بزرگتر یا نادیده گرفتن قوانین مدیریت ریسک سوق دهد. تواضع و واقع بین بودن در مورد توانایی‌های معاملاتی خود بسیار ضروری است'
    },
  ]
  boxCol4 : Array<any> =[
    {
      title:'استراتژی معاملاتی',
      desc: 'استراتژی معاملاتی شما یکی از مهم ترین عواملی است که تعیین می‌کند برای شروع معاملات فارکس به چه میزان سرمایه نیاز دارید. اگر شما یک معامله‌گر روزانه هستید، به سرمایه بیشتری نسبت به یک معامله‌گر سوئینگ نیاز دارید. معامله‌گران روزانه باید سرمایه کافی برای پوشش مارجین مورد نیاز خود داشته باشند، از سوی دیگر، معامله‌گران سوئینگ سرمایه کمتری برای شروع معاملات فارکس نیاز دارند.'
    },
  ]
  boxCol5 : Array<any> =[
    {
      title:'تجربه ',
      desc: 'تجربه معاملاتی شما در میزان سرمایه مورد نیاز برای شروع معامله در فارکس نیز نقش دارد. اگر در ترید تازه کار هستید، بهتر است با سرمایه کمتری شروع کنید تا تجربه بیشتری از بازار کسب کنید. با کسب تجربه بیشتر، می‌توانید سرمایه خود را افزایش دهید و ریسک بیشتری بپذیرید.'
    },
  ]
  boxCol6 : Array<any> =[
    { title:'بروکر',
      desc: ' بروکری که انتخاب می‌کنید همچنین تعیین می‌کند که برای شروع تجارت فارکس به چه میزان سرمایه نیاز دارید. برخی از بروکرها به حداقل سپرده 100 دلاری نیاز دارند، در حالی که برخی دیگر به حداقل سپرده 10000 دلاری یا بیشتر نیاز دارند. شما باید بروکری را انتخاب کنید که شرایط معاملاتی متناسب با استراتژی معاملاتی و ریسکشما را ارائه دهد'
    },
  ]
  boxCol7 : Array<any> =[
    {
      title:'با سرمایه آزاد خود ترید کنید',
      desc: 'اولین نکته مدیریت سرمایه در فارکس، این است که فقط با پولی معامله کنید که توان از دست دادن آن را داشته باشید. به عنوان یک معامله‌گر مبتدی، فقط باید با سرمایه ای معامله کنید که اگر آن را از دست دادید ضرر سنگینی متحمل نشوید. در این روش شما فقط سرمایه ای را به خطر می‌اندازید که در صورت از دست دادن آن، زندگی شما را به شدت تغییر نمی دهد. هرگز با پولی که برای اقلام ضروری نیاز دارید معامله نکنید. پول اجاره، مسکن، غذا و غیره به هیچ عنوان برای ترید مناسب نیستند. هیچ ضمانتی در سودده بودن بازار فارکس نیست پس روی پولی که برای شما مهم است ریسک نکنید'
    },
    {
      title:'تعیین یک درصد ثابت',
      desc: 'رویکرد دیگر این است که در هر معامله درصد ثابتی از موجودی حساب خود را به خطر بیندازید. بنابراین، اگر یک معامله‌گر موجودی حساب 10000 پوندی داشته باشد و تصمیم بگیرد که می‌خواهد 2% از سرمایه خود را روی هر معامله ریسک کند، اولین معامله او 200 پوند ریسک خواهد داشت. مزیت استفاده از این روش در استراتژي مدیریت سرمایه فارکس شما این است که بر خلاف استفاده از مبلغ ثابت، ریسک شما در هر معامله همراه با مانده حساب شما در نوسان است. به همین دلیل اگر به آن پایبند باشد، هرگز نمی‌توانید موجودی حساب خود را به طور کامل از بین ببرید و زمانی که معاملات خوبی را باز کنید، ریسک شما افزایش می‌یابد تا از میزان سرمایه بالاتری که در اختیار دارید استفاده کنید. و زمانی که معاملات شما با ضرر مواجه می‌شوند ریسک شما پایین می‌آید تا کال مارجین نشوید.'
    },
  ]
  boxCol8 : Array<any> =[
    {
      title:'تعین حد ضرر برای هر معامله',
      desc: 'هنگامی که در مورد مقدار پولی که می‌خواهید با آن معامله کنید تصمیم گرفتید، گام بعدی در ایجاد یک مدیریت سرمایه استراتژیک این است که تعیین کنید چقدر در هر معامله ریسک می‌کنید و چگونه می‌خواهید این را اندازه گیری کنید. دو روش متداول برای تعیین مقدار ریسک وجود دارد که هر کدام مزایا و معایب خود را دارند.'
    },
    {
      title:' مد نظر خود را R/R نسبت تعیین کنید',
      desc: 'این انتخاب به استراتژی و شخصیت معاملاتی و به ویژه ریسک پذیری شما بستگی دارد. برای مثال، نسبت R/R ۱ به این معنی است که اگر حداکثر ضرر قابل قبول شما 100 دلار باشد، حد سود شما نیز 100 دلار خواهد بود. اما، نسبت 3 برای همان مقدار ریسک، حد سود 300 دلار را به همراه خواهد داشت. به طور کلی پذیرفته شده است که نسبت R/R باید بالاتر از 1 باشد. این به این دلیل است که اگر سه معامله متوالی را در سود بستید و سپس سه معامله متوالی را با ضرر خارج شدید و نسبت ریسک به پاداش شما 1 بود، در مجموع سودی نخواهید کرد. در حالی که اگر با نسبت R/R 1:2 معامله می‌کردید و سه سود و سه ضرر داشتید، چون حد سود شما بیشتر از حد ضرر هر معامله بود، باز هم در سود خواهید بود.'
    },
  ]
  boxCol9 : Array<any> =[
    {
      title:'تعیین یک مبلغ ثابت ',
      desc: 'برخی از معامله‌گران حداکثر ریسک خود را در هر معامله به عنوان یک مقدار سرمایه ثابت تعیین می‌کنند. به عنوان مثال، یک معامله‌گر ممکن است 10000 دلار سرمایه داشته باشد و تعیین کند که در هر معامله 500 دلار ریسک خواهد کرد. اجرای این روش بسیار ساده است. برای هر معامله، صرف نظر از اینکه شرایط بازار چگونه است، شما دقیقا می‌دانید که چقدر قرار است ریسک کنید. اگر روزانه 10 معامله انجام دهید، بدون محاسبه زیاد می‌دانید که کل ریسک شما 5000 دلار خواهد بود.'
    },
    {
      title:'از اهرم‌های بالا استفاده نکنید',
      desc: 'اهرم به معامله‌گران فارکس این امکان را می‌دهد که پوزیشن‌های بزرگتری نسبت به سرمایه خود باز کنند. اساساً، معامله‌گر برای باز کردن یک پوزیشن اهرمی، از بروکر خود پول قرض می‌کند. به عنوان مثال، اگر معامله‌گری دارای اهرم 1:20 باشد، می‌تواند پوزیشنی به ارزش 10000 پوند با تنها 500 پوند در حساب خود باز کند. معاملات اهرمی در نگاه اول بسیار سودده به نظر می‌رسند و اگر به درستی استفاده شود، می‌تواند سود بسیار خوبی برای شما داشته باشد. با این حال، اهرم یک شمشیر دو لبه است. وقتی از اهرم استفاده می‌کنید در کنار سودهای بزرگ زیان‌های بزرگی نیز خواهید داشت. بنابراین، استفاده از اهرم باید بسیار با دقت انجام شود.'
    },
    {
      title:'برداشت سود',
      desc: 'چیزی که بسیاری از معامله‌گران در آن مقصر هستند این است که هرگز سود خود را برداشت نمی کنند. اگر سود قابل توجهی در معاملات خود کردید مقداری از آن را برداشت کنید، از آن لذت ببرید، کاری ارزشمند با پول انجام دهید. همانطور که در ابتدا گفتیم، یکی از وظایف استراتژی مدیریت سرمایه، به حداکثر رساندن سود شما است. برای انجام این کار، باید در صورت سود کردن، مراقب سود خود باشید. هر چه پول بیشتر در حساب معاملاتی شما بماند، احتمال اینکه با آن معامله کنید و احتمالاً آن را از دست بدهید، بیشتر می‌شود.'
    },
  ]
  boxCol10 : Array<any> =[
    {
      title:'استفاده از یک استراتژی معاملاتی صحیح',
      desc:'اولین نکته مدیریت سرمایه در فارکس، این است که فقط با پولی معامله کنید که توان از دست دادن آن را داشته باشید. به عنوان یک معامله‌گر مبتدی، فقط باید با سرمایه ای معامله کنید که اگر آن را از دست دادید ضرر سنگینی متحمل نشوید. در این روش شما فقط سرمایه ای را به خطر می‌اندازید که در صورت از دست دادن آن، زندگی شما را به شدت تغییر نمی دهد. هرگز با پولی که برای اقلام ضروری نیاز دارید معامله نکنید. پول اجاره، مسکن، غذا و غیره به هیچ عنوان برای ترید مناسب نیستند. هیچ ضمانتی در سودده بودن بازار فارکس نیست پس روی پولی که برای شما مهم است ریسک نکنید'
    },
    {
      title:'استفاده از اهرم با توجه به مدیریت ریسک',
      desc:'استفاده از اهرم در حالی که می‌تواند سود را افزایش دهد، در صورت عدم استفاده عاقلانه می‌تواند منجر به زیان‌های قابل توجهی نیز شود. معامله‌گران باید خطرات مرتبط با معاملات اهرمی را درک کنند و بسیار با احتیاط از آن استفاده کنند. '
    },
  ]
  boxCol11 : Array<any> =[
    {
      title:'آموزش دیدن به طور مستمر',
      desc:'بازارهای مالی همچون فارکس و کریپتو، بسیار پویا هستند. به روز ماندن و اطلاع از آخرین اخبار در این بازارها بسیار مهم است. معامله‌گران باید برای یادگیری در مورد تحلیل‌های بنیادی و فنی، شاخص‌های اقتصادی و احساسات بازار زمان بگذارند. منابع آموزشی متعددی مانند کتاب ها، دوره‌های آنلاین، وبینارها و انجمن‌ها می‌توانند به معامله‌گران کمک کنند تا دانش و مهارت‌های خود را افزایش دهند.'
    },
    {
      title:'حفظ انضباط و کنترل احساسات',
      desc:'همانطور که بالاتر گفته شد، بازارهای مالی بسیار پر نوسان هستند پس  ضروری است که هنگام تحلیل بازار و ورود به معامله احساسات خود را کنترل کنید و به استراتژی معاملاتی خود پایبند باشید، مخصوصا هنگام ضرر کردن. احساساتی مانند ترس و طمع می‌توانند تحلیل شما را تحت الشعاع قرار دهند و منجر به تصمیمات هیجانی شوند. داشتن قوانین سختگیرانه برای ورود به معامله و تمرین خودکنترلی می‌تواند به جلوگیری از گرفتن تصمیمات هیجانی کمک کند.'
    },
  ]
  boxCol12 : Array<any> =[
    {
      title:'استفاده از تکنیک‌های مدیریت ریسک',
      desc:'برخی از معامله‌گران حداکثر ریسک خود را در هر معامله به عنوان یک مقدار سرمایه ثابت تعیین می‌کنند. به عنوان مثال، یک معامله‌گر ممکن است 10000 دلار سرمایه داشته باشد و تعیین کند که در هر معامله 500 دلار ریسک خواهد کرد. اجرای این روش بسیار ساده است. برای هر معامله، صرف نظر از اینکه شرایط بازار چگونه است، شما دقیقا می‌دانید که چقدر قرار است ریسک کنید. اگر روزانه 10 معامله انجام دهید، بدون محاسبه زیاد می‌دانید که کل ریسک شما 5000 دلار خواهد بود.'
    },
    {
      title:'داشتن ژورنال معاملاتی',
      desc:'این به معامله‌گران اجازه می‌دهد تا معاملات خود را تجزیه و تحلیل کنند، الگوها را شناسایی کنند و از اشتباهات گذشته درس بگیرند. ژورنال شما باید شامل جزئیاتی مانند نقاط ورود و خروج، دلایل ورود به معامله، احساسات شما هنگام ورود و در طول معامله و نتیجه آن معامله باشد. مرور منظم این ژورنال می‌تواند به بهبود و اصلاح استراتژی‌های معاملاتی شما کمک کند.'
    },
  ]
}
